# Taps
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'miderwong/flutter'

# Binaries
brew 'awscli'
brew 'bash'
brew 'coreutils'
brew 'dnsmasq', restart_service: true
brew 'git'
brew 'hub'
brew 'mackup'
brew 'mas' # Mac App Store manager
brew 'stripe/stripe-cli/stripe'
brew 'subversion'
brew 'tree' # List directories in a tree structure
brew 'zlib' # Needed for Memcached

# Development

brew 'php'
brew 'composer'
brew 'imagemagick'
brew 'mysql'
brew 'nginx'
brew 'node'
brew 'redis'
brew 'yarn'
brew 'miderwong/flutter/flutter'

# Apps
cask '1password'
cask 'adobe-creative-cloud'
cask 'alfred'
cask 'autodesk-fusion360'
cask 'discord'
cask 'dropbox'
cask 'figma'
cask 'figmadaemon'
cask 'firefox'
cask 'github'
cask 'google-backup-and-sync'
cask 'google-chat'
cask 'google-chrome'
cask 'insomnia'
cask 'notion'
cask 'parallels'
cask 'parallels-toolbox'
cask 'phpstorm'
cask 'qbserve'
cask 'sequel-pro'
cask 'sizzy'
cask 'slack'
cask 'sourcetree'
cask 'spotify'
cask 'sublime-text'
cask 'tableplus'
cask 'teamviewer'
cask 'telegram'
cask 'the-unarchiver'
cask 'there'
cask 'vagrant'
cask 'virtualbox' # Might need to allow access in Security settings
cask 'virtualbox-extension-pack'
cask 'visual-studio-code'
cask 'vlc'
cask 'whatsapp'

# Fonts
cask 'font-lato'
cask 'font-open-sans'
cask 'font-roboto'
cask 'font-roboto-condensed'
cask 'font-source-code-pro-for-powerline'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'

# Mac App Store
mas 'ColorSlurp', id: 1287239339
mas 'Magnet', id: 441258766
mas 'DirEqual', id: 1435575700
mas 'Microsoft Remote Desktop', id: 1295203466
mas 'TickTick', id: 966085870
mas 'Spark', id: 1176895641
mas 'Remote Mouse', id: 403195710