# Taps
tap 'homebrew/cask'
tap 'homebrew/cask-drivers'
tap 'homebrew/cask-fonts'
tap deligoez/cask
# tap 'homebrew/cask-versions'
# tap 'miderwong/flutter'

# Binaries
brew 'coreutils'
brew 'dnsmasq', restart_service: true
brew 'git'
# brew 'hub'
brew 'gh'
# brew 'libmemcached'
brew 'mackup'
brew 'mas' # Mac App Store manager
brew 'pkg-config' #Needed for Memcached and imagick
brew 'tree' # List directories in a tree structure
# brew 'zlib' # Needed for Memcached
# brew 'awscli'
# brew 'bash'
# brew 'stripe/stripe-cli/stripe'
brew 'subversion'

# Development

brew 'php'
brew 'composer'
brew 'imagemagick'
brew 'mysql'
brew 'nginx'
brew 'node'
brew 'redis'
# brew 'yarn'
# brew 'miderwong/flutter/flutter'

# Apps
cask 'alfred'
cask 'anydesk'
cask 'audacity'
cask 'discord'
cask 'figma'
cask 'figmadaemon'
cask 'firefox'
cask 'github'
cask 'google-chrome'
cask 'google-drive'
cask 'helo'
cask 'hyper'
cask 'iterm2'
cask 'logitech-options'
cask 'microsoft-office'
cask 'notion'
cask 'parallels'
cask 'phpstorm'
cask 'ray'
cask 'screenflow'
cask 'signal'
cask 'sourcetree'
cask 'tableplus'
cask 'telegram'
cask 'the-unarchiver'
cask 'tinkerwell'
cask 'tint'
cask 'visual-studio-code'
cask 'vlc'
cask 'xdebug-toggler'
# cask '1password'
# cask 'adobe-creative-cloud'
# cask 'autodesk-fusion360'
# cask 'dropbox'
# cask 'google-backup-and-sync'
# cask 'google-chat'
# cask 'insomnia'
# cask 'parallels-toolbox'
# cask 'qbserve'
# cask 'sequel-pro'
# cask 'sizzy'
# cask 'slack'
# cask 'spotify'
# cask 'sublime-text' # Disabled as can't install v3
# cask 'teamviewer'
# cask 'there'
# cask 'vagrant'
# cask 'virtualbox' # Might need to allow access in Security settings
# cask 'virtualbox-extension-pack'
# cask 'whatsapp'

# Fonts
cask 'font-fira-code'
cask 'font-lato'
cask 'font-open-sans'
cask 'font-roboto'
cask 'font-roboto-condensed'
cask 'font-source-code-pro-for-powerline'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'

# Mac App Store
mas 'Bear', id: 1091189122
mas 'Dato', id: 1470584107
mas 'Divvy', id: 413857545
mas 'EasyRes', id: 688211836
mas 'Remote Mouse', id: 403195710
mas 'Spark', id: 1176895641
mas 'Things', id: 904280696
# mas 'Todoist', id: 585829637
# mas 'ColorSlurp', id: 1287239339
# mas 'DirEqual', id: 1435575700
# mas 'Magnet', id: 441258766
# mas 'Microsoft Remote Desktop', id: 1295203466
# mas 'TickTick', id: 966085870
